### Report for email_and_alerting on environment: dev

#### Terraform Format and Style 🖌`success`
<details><summary>Format Output</summary>

```


```

</details>

#### Terraform Initialization ⚙️`success`
<details><summary>Initialization Output</summary>

```

Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.
Initializing provider plugins...
- Finding hashicorp/aws versions matching "~> 6.0"...
- Installing hashicorp/aws v6.27.0...
- Installed hashicorp/aws v6.27.0 (signed by HashiCorp)
Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

```

</details>

#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan (48 to add, 0 to change, 0 to destroy)</summary>

```


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.email_report_cloudwatch_log_access will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "email_report_cloudwatch_log_access" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + resources = [
              + (known after apply),
            ]
          + sid       = "CloudwatchLogs"
        }
    }

  # data.aws_iam_policy_document.log_alerts_cloudwatch_log_access will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "log_alerts_cloudwatch_log_access" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + resources = [
              + (known after apply),
              + (known after apply),
              + (known after apply),
            ]
          + sid       = "CloudwatchLogs"
        }
    }

  # data.aws_iam_policy_document.ses_to_s3 will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "ses_to_s3" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:PutObject",
            ]
          + resources = [
              + (known after apply),
            ]
          + sid       = "AllowSESPuts"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "343515223843",
                ]
              + variable = "aws:SourceAccount"
            }
          + condition {
              + test     = "StringLike"
              + values   = [
                  + (known after apply),
                ]
              + variable = "aws:SourceArn"
            }

          + principals {
              + identifiers = [
                  + "ses.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # data.aws_iam_policy_document.store_asid_lookup_lambda_access will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "store_asid_lookup_lambda_access" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "WriteLogsAndLogStream"
        }
      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetObject",
              + "s3:GetObjectVersion",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "ReadWriteEmails"
        }
      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "ListBucket"
        }
      + statement {
          + actions   = [
              + "s3:PutObject",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:s3:::prm-gp2gp-asid-lookup-dev/*",
            ]
          + sid       = "WriteObjects"
        }
      + statement {
          + actions   = [
              + "ssm:GetParameter",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:ssm:eu-west-2:343515223843:parameter/registrations/dev/data-pipeline/gp2gp-dashboard/email-storage-bucket-name",
              + "arn:aws:ssm:eu-west-2:343515223843:parameter/registrations/dev/data-pipeline/gp2gp-dashboard/permitted-emails",
            ]
          + sid       = "GetSSMParameter"
        }
      + statement {
          + actions   = [
              + "states:ListStateMachines",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
          + sid       = "ListStepFunctions"
        }
      + statement {
          + actions   = [
              + "states:StartExecution",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:states:eu-west-2:343515223843:stateMachine:ods-downloader-pipeline",
            ]
          + sid       = "StepFunctionExecution"
        }
    }

  # aws_cloudwatch_log_group.email_report_lambda will be created
  + resource "aws_cloudwatch_log_group" "email_report_lambda" {
      + arn                         = (known after apply)
      + deletion_protection_enabled = (known after apply)
      + id                          = (known after apply)
      + log_group_class             = (known after apply)
      + name                        = "/aws/lambda/dev-email-report-lambda"
      + name_prefix                 = (known after apply)
      + region                      = "eu-west-2"
      + retention_in_days           = 60
      + skip_destroy                = false
      + tags                        = {
          + "ApplicationRole"     = "AwsCloudwatchLogGroup"
          + "BackupLocal"         = "False"
          + "BackupRemote"        = "False"
          + "CostCentre"          = "P0688/04"
          + "CreatedBy"           = "gp2gp-reporting-infrastructure"
          + "Customer"            = "NHS D"
          + "DataType"            = "None"
          + "Environment"         = "dev"
          + "Name"                = "dev-email-report-lambda"
          + "OnOffPattern"        = "AlwaysOn"
          + "Owner"               = "Candice Moore"
          + "Programme"           = "GP IT Futures"
          + "Project"             = "Patient Record Migration"
          + "ProjectType"         = "Public beta"
          + "PublicFacing"        = "N"
          + "ServiceCategory"     = "Bronze"
          + "TagVersion"          = "1"
          + "Team"                = "Registrations"
          + "data_classification" = "1"
          + "envtype"             = "dev"
        }
      + tags_all                    = {
          + "ApplicationRole"     = "AwsCloudwatchLogGroup"
          + "BackupLocal"         = "False"
          + "BackupRemote"        = "False"
          + "CostCentre"          = "P0688/04"
          + "CreatedBy"           = "gp2gp-reporting-infrastructure"
          + "Customer"            = "NHS D"
          + "DataType"            = "None"
          + "Environment"         = "dev"
          + "Name"                = "dev-email-report-lambda"
          + "OnOffPattern"        = "AlwaysOn"
          + "Owner"               = "Candice Moore"
          + "Programme"           = "GP IT Futures"
          + "Project"             = "Patient Record Migration"
          + "ProjectType"         = "Public beta"
          + "PublicFacing"        = "N"
          + "ServiceCategory"     = "Bronze"
          + "TagVersion"          = "1"
          + "Team"                = "Registrations"
          + "data_classification" = "1"
          + "envtype"             = "dev"
        }
    }

  # aws_cloudwatch_log_group.gp2gp_dashboard_alert will be created
  + resource "aws_cloudwatch_log_group" "gp2gp_dashboard_alert" {
      + arn                         = (known after apply)
      + deletion_protection_enabled = (known after apply)
      + id                          = (known after apply)
      + log_group_class             = (known after apply)
      + name                        = "/aws/lambda/dev-gp2gp-dashboard-alert-lambda"
      + name_prefix                 = (known after apply)
      + region                      = "eu-west-2"
      + retention_in_days           = 60
      + skip_destroy                = false
      + tags                        = {
          + "ApplicationRole"     = "AwsCloudwatchLogGroup"
          + "BackupLocal"         = "False"
          + "BackupRemote"        = "False"
          + "CostCentre"          = "P0688/04"
          + "CreatedBy"           = "gp2gp-reporting-infrastructure"
          + "Customer"            = "NHS D"
          + "DataType"            = "None"
          + "Environment"         = "dev"
          + "Name"                = "dev-gp2gp-dashboard-alert-lambda"
          + "OnOffPattern"        = "AlwaysOn"
          + "Owner"               = "Candice Moore"
          + "Programme"           = "GP IT Futures"
          + "Project"             = "Patient Record Migration"
          + "ProjectType"         = "Public beta"
          + "PublicFacing"        = "N"
          + "ServiceCategory"     = "Bronze"
          + "TagVersion"          = "1"
          + "Team"                = "Registrations"
          + "data_classification" = "1"
          + "envtype"             = "dev"
        }
      + tags_all                    = {
          + "ApplicationRole"     = "AwsCloudwatchLogGroup"
          + "BackupLocal"         = "False"
          + "BackupRemote"        = "False"
          + "CostCentre"          = "P0688/04"
          + "CreatedBy"           = "gp2gp-reporting-infrastructure"
          + "Customer"            = "NHS D"
          + "DataType"            = "None"
          + "Environment"         = "dev"
          + "Name"                = "dev-gp2gp-dashboard-alert-lambda"
          + "OnOffPattern"        = "AlwaysOn"
          + "Owner"               = "Candice Moore"
          + "Programme"           = "GP IT Futures"
          + "Project"             = "Patient Record Migration"
          + "ProjectType"         = "Public beta"
          + "PublicFacing"        = "N"
          + "ServiceCategory"     = "Bronze"
          + "TagVersion"          = "1"
          + "Team"                = "Registrations"
          + "data_classification" = "1"
          + "envtype"             = "dev"
        }
    }

  # aws_cloudwatch_log_group.log_alerts_pipeline_error will be created
  + resource "aws_cloudwatch_log_group" "log_alerts_pipeline_error" {
      + arn                         = (known after apply)
      + deletion_protection_enabled = (known after apply)
      + id                          = (known after apply)
      + log_group_class             = (known after apply)
      + name                        = "/aws/lambda/dev-log-alerts-pipeline-error-lambda"
      + name_prefix                 = (known after apply)
      + region                      = "eu-west-2"
      + retention_in_days           = 60
      + skip_destroy                = false
      + tags                        = {
          + "ApplicationRole"     = "AwsCloudwatchLogGroup"
          + "BackupLocal"         = "False"
          + "BackupRemote"        = "False"
          + "CostCentre"          = "P0688/04"
          + "CreatedBy"           = "gp2gp-reporting-infrastructure"
          + "Customer"            = "NHS D"
          + "DataType"            = "None"
          + "Environment"         = "dev"
          + "Name"                = "dev-log-alerts-pipeline-error-lambda"
          + "OnOffPattern"        = "AlwaysOn"
          + "Owner"               = "Candice Moore"
          + "Programme"           = "GP IT Futures"
          + "Project"             = "Patient Record Migration"
          + "ProjectType"         = "Public beta"
          + "PublicFacing"        = "N"
          + "ServiceCategory"     = "Bronze"
          + "TagVersion"          = "1"
          + "Team"                = "Registrations"
          + "data_classification" = "1"
          + "envtype"             = "dev"
        }
      + tags_all                    = {
          + "ApplicationRole"     = "AwsCloudwatchLogGroup"
          + "BackupLocal"         = "False"
          + "BackupRemote"        = "False"
          + "CostCentre"          = "P0688/04"
          + "CreatedBy"           = "gp2gp-reporting-infrastructure"
          + "Customer"            = "NHS D"
          + "DataType"            = "None"
          + "Environment"         = "dev"
          + "Name"                = "dev-log-alerts-pipeline-error-lambda"
          + "OnOffPattern"        = "AlwaysOn"
          + "Owner"               = "Candice Moore"
          + "Programme"           = "GP IT Futures"
          + "Project"             = "Patient Record Migration"
          + "ProjectType"         = "Public beta"
          + "PublicFacing"        = "N"
          + "ServiceCategory"     = "Bronze"
          + "TagVersion"          = "1"
          + "Team"                = "Registrations"
          + "data_classification" = "1"
          + "envtype"             = "dev"
        }
    }

  # aws_cloudwatch_log_group.log_alerts_technical_failures_above_threshold will be created
  + resource "aws_cloudwatch_log_group" "log_alerts_technical_failures_above_threshold" {
      + arn                         = (known after apply)
      + deletion_protection_enabled = (known after apply)
      + id                          = (known after apply)
      + log_group_class             = (known after apply)
      + name                        = "/aws/lambda/dev-log-alerts-technical-failures-above-threshold-lambda"
      + name_prefix                 = (known after apply)
      + region                      = "eu-west-2"
      + retention_in_days           = 60
      + skip_destroy                = false
      + tags                        = {
          + "ApplicationRole"     = "AwsCloudwatchLogGroup"
          + "BackupLocal"         = "False"
          + "BackupRemote"        = "False"
          + "CostCentre"          = "P0688/04"
          + "CreatedBy"           = "gp2gp-reporting-infrastructure"
          + "Customer"            = "NHS D"
          + "DataType"            = "None"
          + "Environment"         = "dev"
          + "Name"                = "dev-log-alerts-technical-failures-above-threshold-lambda"
          + "OnOffPattern"        = "AlwaysOn"
          + "Owner"               = "Candice Moore"
          + "Programme"           = "GP IT Futures"
          + "Project"             = "Patient Record Migration"
          + "ProjectType"         = "Public beta"
          + "PublicFacing"        = "N"
          + "ServiceCategory"     = "Bronze"
          + "TagVersion"          = "1"
          + "Team"                = "Registrations"
          + "data_classification" = "1"
          + "envtype"             = "dev"
        }
      + tags_all                    = {
          + "ApplicationRole"     = "AwsCloudwatchLogGroup"
          + "BackupLocal"         = "False"
          + "BackupRemote"        = "False"
          + "CostCentre"          = "P0688/04"
          + "CreatedBy"           = "gp2gp-reporting-infrastructure"
          + "Customer"            = "NHS D"
          + "DataType"            = "None"
          + "Environment"         = "dev"
          + "Name"                = "dev-log-alerts-technical-failures-above-threshold-lambda"
          + "OnOffPattern"        = "AlwaysOn"
          + "Owner"               = "Candice Moore"
          + "Programme"           = "GP IT Futures"
          + "Project"             = "Patient Record Migration"
          + "ProjectType"         = "Public beta"
          + "PublicFacing"        = "N"
          + "ServiceCategory"     = "Bronze"
          + "TagVersion"          = "1"
          + "Team"                = "Registrations"
          + "data_classification" = "1"
          + "envtype"             = "dev"
        }
    }

  # aws_cloudwatch_log_group.store_asid_lookup will be created
  + resource "aws_cloudwatch_log_group" "store_asid_lookup" {
      + arn                         = (known after apply)
      + deletion_protection_enabled = (known after apply)
      + id                          = (known after apply)
      + log_group_class             = (known after apply)
      + name                        = "/aws/lambda/dev_store_asid_lookup_lambda"
      + name_prefix                 = (known after apply)
      + region                      = "eu-west-2"
      + retention_in_days           = 0
      + skip_destroy                = false
      + tags_all                    = (known after apply)
    }

  # aws_iam_policy.email_report_cloudwatch_log_access will be created
  + resource "aws_iam_policy" "email_report_cloudwatch_log_access" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "dev-email-report-cloudwatch-log-access"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # aws_iam_policy.email_report_lambda_send_raw_email will be created
  + resource "aws_iam_policy" "email_report_lambda_send_raw_email" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "dev-email-report-send-raw-email"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "ses:SendRawEmail"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ses:eu-west-2:343515223843:identity/gp2gp.report@nhs.net"
                      + Sid      = "SendEmailWithAttachment"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # aws_iam_policy.email_report_lambda_ssm_access will be created
  + resource "aws_iam_policy" "email_report_lambda_ssm_access" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "dev-email-report-lambda-ssm-access"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "ssm:GetParameter"
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:ssm:eu-west-2:343515223843:parameter/registrations/dev/user-input/email-report-sender-email-key",
                          + "arn:aws:ssm:eu-west-2:343515223843:parameter/registrations/dev/user-input/email-report-sender-email",
                          + "arn:aws:ssm:eu-west-2:343515223843:parameter/registrations/dev/user-input/email-report-recipient-internal-email",
                          + "arn:aws:ssm:eu-west-2:343515223843:parameter/registrations/dev/user-input/email-report-recipient-email",
                        ]
                      + Sid      = "GetSSMParameter"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # aws_iam_policy.log_alerts_cloudwatch_log_access will be created
  + resource "aws_iam_policy" "log_alerts_cloudwatch_log_access" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "dev-log-alerts-cloudwatch-log-access"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # aws_iam_policy.log_alerts_ssm_access will be created
  + resource "aws_iam_policy" "log_alerts_ssm_access" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "dev-log-alerts-ssm-access"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "ssm:GetParameter"
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:ssm:eu-west-2:343515223843:parameter/registrations/dev/user-input/log-alerts/slack-channel-id",
                          + "arn:aws:ssm:eu-west-2:343515223843:parameter/registrations/dev/user-input/log-alerts/slack-bot-token",
                          + "arn:aws:ssm:eu-west-2:343515223843:parameter/registrations/dev/user-input/log-alerts-general-webhook-url",
                        ]
                      + Sid      = "GetSSMParameter"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # aws_iam_policy.reports_generator_bucket_read_access will be created
  + resource "aws_iam_policy" "reports_generator_bucket_read_access" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = (sensitive value)
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "s3:ListBucket"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::prm-gp2gp-reports-dev"
                      + Sid      = "ListBucket"
                    },
                  + {
                      + Action   = "s3:GetObject"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::prm-gp2gp-reports-dev/*"
                      + Sid      = "ReadObjects"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # aws_iam_policy.store_asid_lookup_lambda will be created
  + resource "aws_iam_policy" "store_asid_lookup_lambda" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "IAM policy for Store ASID Lookup Lambda"
      + id               = (known after apply)
      + name             = "dev-store-asid-lookup-lambda-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # aws_iam_role.email_report_lambda_role will be created
  + resource "aws_iam_role" "email_report_lambda_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "dev-email-report-lambda-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role.log_alerts_lambda_role will be created
  + resource "aws_iam_role" "log_alerts_lambda_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "dev-log-alerts-lambda-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role.store_asid_lookup_lambda will be created
  + resource "aws_iam_role" "store_asid_lookup_lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "dev-store-asid-lookup-lambda-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role_policy_attachment.email_report_lambda_attach_bucket_read_access will be created
  + resource "aws_iam_role_policy_attachment" "email_report_lambda_attach_bucket_read_access" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "dev-email-report-lambda-role"
    }

  # aws_iam_role_policy_attachment.email_report_lambda_attach_log_access will be created
  + resource "aws_iam_role_policy_attachment" "email_report_lambda_attach_log_access" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "dev-email-report-lambda-role"
    }

  # aws_iam_role_policy_attachment.email_report_lambda_attach_log_alerts_access will be created
  + resource "aws_iam_role_policy_attachment" "email_report_lambda_attach_log_alerts_access" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "dev-email-report-lambda-role"
    }

  # aws_iam_role_policy_attachment.email_report_lambda_attach_log_alerts_log_access will be created
  + resource "aws_iam_role_policy_attachment" "email_report_lambda_attach_log_alerts_log_access" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "dev-email-report-lambda-role"
    }

  # aws_iam_role_policy_attachment.email_report_lambda_attach_send_raw_email will be created
  + resource "aws_iam_role_policy_attachment" "email_report_lambda_attach_send_raw_email" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "dev-email-report-lambda-role"
    }

  # aws_iam_role_policy_attachment.email_report_lambda_attach_ssm_access will be created
  + resource "aws_iam_role_policy_attachment" "email_report_lambda_attach_ssm_access" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "dev-email-report-lambda-role"
    }

  # aws_iam_role_policy_attachment.store_asid_lookup_lambda will be created
  + resource "aws_iam_role_policy_attachment" "store_asid_lookup_lambda" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "dev-store-asid-lookup-lambda-role"
    }

  # aws_lambda_function.email_report_lambda will be created
  + resource "aws_lambda_function" "email_report_lambda" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "/home/runner/work/gp2gp-reporting-infrastructure/gp2gp-reporting-infrastructure/lambdas/build/email_report.zip"
      + function_name                  = "dev-email-report-lambda"
      + handler                        = "main.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "eu-west-2"
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.14"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "/5wbLQFl/5PZ/p3vBtzG+url/JmubOKIS537UL3xSws="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "ApplicationRole"     = "AwsLambdaFunction"
          + "BackupLocal"         = "False"
          + "BackupRemote"        = "False"
          + "CostCentre"          = "P0688/04"
          + "CreatedBy"           = "gp2gp-reporting-infrastructure"
          + "Customer"            = "NHS D"
          + "DataType"            = "None"
          + "Environment"         = "dev"
          + "Name"                = "dev-email-report-lambda"
          + "OnOffPattern"        = "AlwaysOn"
          + "Owner"               = "Candice Moore"
          + "Programme"           = "GP IT Futures"
          + "Project"             = "Patient Record Migration"
          + "ProjectType"         = "Public beta"
          + "PublicFacing"        = "N"
          + "ServiceCategory"     = "Bronze"
          + "TagVersion"          = "1"
          + "Team"                = "Registrations"
          + "data_classification" = "1"
          + "envtype"             = "dev"
        }
      + tags_all                       = {
          + "ApplicationRole"     = "AwsLambdaFunction"
          + "BackupLocal"         = "False"
          + "BackupRemote"        = "False"
          + "CostCentre"          = "P0688/04"
          + "CreatedBy"           = "gp2gp-reporting-infrastructure"
          + "Customer"            = "NHS D"
          + "DataType"            = "None"
          + "Environment"         = "dev"
          + "Name"                = "dev-email-report-lambda"
          + "OnOffPattern"        = "AlwaysOn"
          + "Owner"               = "Candice Moore"
          + "Programme"           = "GP IT Futures"
          + "Project"             = "Patient Record Migration"
          + "ProjectType"         = "Public beta"
          + "PublicFacing"        = "N"
          + "ServiceCategory"     = "Bronze"
          + "TagVersion"          = "1"
          + "Team"                = "Registrations"
          + "data_classification" = "1"
          + "envtype"             = "dev"
        }
      + timeout                        = 15
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "EMAIL_REPORT_RECIPIENT_EMAIL_PARAM_NAME"          = "/registrations/dev/user-input/email-report-recipient-email"
              + "EMAIL_REPORT_RECIPIENT_INTERNAL_EMAIL_PARAM_NAME" = "/registrations/dev/user-input/email-report-recipient-internal-email"
              + "EMAIL_REPORT_SENDER_EMAIL_KEY_PARAM_NAME"         = "/registrations/dev/user-input/email-report-sender-email-key"
              + "EMAIL_REPORT_SENDER_EMAIL_PARAM_NAME"             = "/registrations/dev/user-input/email-report-sender-email"
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # aws_lambda_function.gp2gp_dashboard_alert_lambda will be created
  + resource "aws_lambda_function" "gp2gp_dashboard_alert_lambda" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "/home/runner/work/gp2gp-reporting-infrastructure/gp2gp-reporting-infrastructure/lambdas/build/gp2gp_dashboard_alert.zip"
      + function_name                  = "dev-gp2gp-dashboard-alert-lambda"
      + handler                        = "main.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "eu-west-2"
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.14"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "kU9hra9Qbw45PZTua6cyqn0e7foma7wBCzKL+RV1f3k="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "ApplicationRole"     = "AwsLambdaFunction"
          + "BackupLocal"         = "False"
          + "BackupRemote"        = "False"
          + "CostCentre"          = "P0688/04"
          + "CreatedBy"           = "gp2gp-reporting-infrastructure"
          + "Customer"            = "NHS D"
          + "DataType"            = "None"
          + "Environment"         = "dev"
          + "Name"                = "dev-gp2gp-dashboard-alert-lambda"
          + "OnOffPattern"        = "AlwaysOn"
          + "Owner"               = "Candice Moore"
          + "Programme"           = "GP IT Futures"
          + "Project"             = "Patient Record Migration"
          + "ProjectType"         = "Public beta"
          + "PublicFacing"        = "N"
          + "ServiceCategory"     = "Bronze"
          + "TagVersion"          = "1"
          + "Team"                = "Registrations"
          + "data_classification" = "1"
          + "envtype"             = "dev"
        }
      + tags_all                       = {
          + "ApplicationRole"     = "AwsLambdaFunction"
          + "BackupLocal"         = "False"
          + "BackupRemote"        = "False"
          + "CostCentre"          = "P0688/04"
          + "CreatedBy"           = "gp2gp-reporting-infrastructure"
          + "Customer"            = "NHS D"
          + "DataType"            = "None"
          + "Environment"         = "dev"
          + "Name"                = "dev-gp2gp-dashboard-alert-lambda"
          + "OnOffPattern"        = "AlwaysOn"
          + "Owner"               = "Candice Moore"
          + "Programme"           = "GP IT Futures"
          + "Project"             = "Patient Record Migration"
          + "ProjectType"         = "Public beta"
          + "PublicFacing"        = "N"
          + "ServiceCategory"     = "Bronze"
          + "TagVersion"          = "1"
          + "Team"                = "Registrations"
          + "data_classification" = "1"
          + "envtype"             = "dev"
        }
      + timeout                        = 15
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "ENVIRONMENT"                               = "dev"
              + "GP2GP_DASHBOARD_NATIONAL_STATISTICS_URL"   = "https://dev.gp-registrations-data.nhs.uk/national-gp2gp-statistics"
              + "GP2GP_DASHBOARD_STEP_FUNCTION_URL"         = "https://eu-west-2.console.aws.amazon.com/states/home#/statemachines/view/arn:aws:states:eu-west-2:343515223843:stateMachine:dashboard-pipeline"
              + "LOG_ALERTS_GENERAL_WEBHOOK_URL_PARAM_NAME" = "/registrations/dev/user-input/log-alerts-general-webhook-url"
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # aws_lambda_function.log_alerts_pipeline_error_lambda will be created
  + resource "aws_lambda_function" "log_alerts_pipeline_error_lambda" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "/home/runner/work/gp2gp-reporting-infrastructure/gp2gp-reporting-infrastructure/lambdas/build/log_alerts_pipeline_error.zip"
      + function_name                  = "dev-log-alerts-pipeline-error-lambda"
      + handler                        = "main.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "eu-west-2"
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.14"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "mqiFRIjasvyj2hgJiq455Rw94xbCxQVdOmwDTEgepZ0="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "ApplicationRole"     = "AwsLambdaFunction"
          + "BackupLocal"         = "False"
          + "BackupRemote"        = "False"
          + "CostCentre"          = "P0688/04"
          + "CreatedBy"           = "gp2gp-reporting-infrastructure"
          + "Customer"            = "NHS D"
          + "DataType"            = "None"
          + "Environment"         = "dev"
          + "Name"                = "dev-log-alerts-pipeline-error-lambda"
          + "OnOffPattern"        = "AlwaysOn"
          + "Owner"               = "Candice Moore"
          + "Programme"           = "GP IT Futures"
          + "Project"             = "Patient Record Migration"
          + "ProjectType"         = "Public beta"
          + "PublicFacing"        = "N"
          + "ServiceCategory"     = "Bronze"
          + "TagVersion"          = "1"
          + "Team"                = "Registrations"
          + "data_classification" = "1"
          + "envtype"             = "dev"
        }
      + tags_all                       = {
          + "ApplicationRole"     = "AwsLambdaFunction"
          + "BackupLocal"         = "False"
          + "BackupRemote"        = "False"
          + "CostCentre"          = "P0688/04"
          + "CreatedBy"           = "gp2gp-reporting-infrastructure"
          + "Customer"            = "NHS D"
          + "DataType"            = "None"
          + "Environment"         = "dev"
          + "Name"                = "dev-log-alerts-pipeline-error-lambda"
          + "OnOffPattern"        = "AlwaysOn"
          + "Owner"               = "Candice Moore"
          + "Programme"           = "GP IT Futures"
          + "Project"             = "Patient Record Migration"
          + "ProjectType"         = "Public beta"
          + "PublicFacing"        = "N"
          + "ServiceCategory"     = "Bronze"
          + "TagVersion"          = "1"
          + "Team"                = "Registrations"
          + "data_classification" = "1"
          + "envtype"             = "dev"
        }
      + timeout                        = 15
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "CLOUDWATCH_DASHBOARD_URL"                  = "https://console.aws.amazon.com/cloudwatch/home?#dashboards:"
              + "LOG_ALERTS_GENERAL_WEBHOOK_URL_PARAM_NAME" = "/registrations/dev/user-input/log-alerts-general-webhook-url"
              + "SLACK_BOT_TOKEN_PARAM_NAME"                = "/registrations/dev/user-input/log-alerts/slack-bot-token"
              + "SLACK_CHANNEL_ID_PARAM_NAME"               = "/registrations/dev/user-input/log-alerts/slack-channel-id"
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # aws_lambda_function.log_alerts_technical_failures_above_threshold_lambda will be created
  + resource "aws_lambda_function" "log_alerts_technical_failures_above_threshold_lambda" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "/home/runner/work/gp2gp-reporting-infrastructure/gp2gp-reporting-infrastructure/lambdas/build/log_alerts_technical_failures_above_threshold.zip"
      + function_name                  = "dev-log-alerts-technical-failures-above-threshold-lambda"
      + handler                        = "main.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "eu-west-2"
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.14"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "3gTw3dztlRdKRrJmJjO9y4Ni3XnIBjJXCB27mF31tYs="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "ApplicationRole"     = "AwsLambdaFunction"
          + "BackupLocal"         = "False"
          + "BackupRemote"        = "False"
          + "CostCentre"          = "P0688/04"
          + "CreatedBy"           = "gp2gp-reporting-infrastructure"
          + "Customer"            = "NHS D"
          + "DataType"            = "None"
          + "Environment"         = "dev"
          + "Name"                = "dev-log-alerts-technical-failures-above-threshold-lambda"
          + "OnOffPattern"        = "AlwaysOn"
          + "Owner"               = "Candice Moore"
          + "Programme"           = "GP IT Futures"
          + "Project"             = "Patient Record Migration"
          + "ProjectType"         = "Public beta"
          + "PublicFacing"        = "N"
          + "ServiceCategory"     = "Bronze"
          + "TagVersion"          = "1"
          + "Team"                = "Registrations"
          + "data_classification" = "1"
          + "envtype"             = "dev"
        }
      + tags_all                       = {
          + "ApplicationRole"     = "AwsLambdaFunction"
          + "BackupLocal"         = "False"
          + "BackupRemote"        = "False"
          + "CostCentre"          = "P0688/04"
          + "CreatedBy"           = "gp2gp-reporting-infrastructure"
          + "Customer"            = "NHS D"
          + "DataType"            = "None"
          + "Environment"         = "dev"
          + "Name"                = "dev-log-alerts-technical-failures-above-threshold-lambda"
          + "OnOffPattern"        = "AlwaysOn"
          + "Owner"               = "Candice Moore"
          + "Programme"           = "GP IT Futures"
          + "Project"             = "Patient Record Migration"
          + "ProjectType"         = "Public beta"
          + "PublicFacing"        = "N"
          + "ServiceCategory"     = "Bronze"
          + "TagVersion"          = "1"
          + "Team"                = "Registrations"
          + "data_classification" = "1"
          + "envtype"             = "dev"
        }
      + timeout                        = 15
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "LOG_ALERTS_GENERAL_WEBHOOK_URL_PARAM_NAME"                            = "/registrations/dev/user-input/log-alerts-general-webhook-url"
              + "LOG_ALERTS_TECHNICAL_FAILURES_ABOVE_THRESHOLD_RATE_PARAM_NAME"        = "/registrations/dev/user-input/log-alerts-technical-failures-above-threshold-rate"
              + "LOG_ALERTS_TECHNICAL_FAILURES_ABOVE_THRESHOLD_WEBHOOK_URL_PARAM_NAME" = "/registrations/dev/user-input/log-alerts-technical-failures-above-threshold-webhook-url"
              + "LOG_ALERTS_TECHNICAL_FAILURES_WEBHOOK_URL_PARAM_NAME"                 = "/registrations/dev/user-input/log-alerts-technical-failures-webhook-url"
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # aws_lambda_function.store_asid_lookup will be created
  + resource "aws_lambda_function" "store_asid_lookup" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "/home/runner/work/gp2gp-reporting-infrastructure/gp2gp-reporting-infrastructure/lambdas/build/store_asid_lookup.zip"
      + function_name                  = "dev_store_asid_lookup_lambda"
      + handler                        = "main.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 1769
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "eu-west-2"
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.14"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "9TQvIOI09iXVZ0VZyK3IZZpjHSXFkBPFGLidC2aNtjc="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 60
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "EMAIL_USER"  = (sensitive value)
              + "ENVIRONMENT" = "dev"
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # aws_lambda_permission.allow_trigger_from_s3_object_created will be created
  + resource "aws_lambda_permission" "allow_trigger_from_s3_object_created" {
      + action              = "lambda:InvokeFunction"
      + function_name       = (known after apply)
      + id                  = (known after apply)
      + principal           = "s3.amazonaws.com"
      + region              = "eu-west-2"
      + source_account      = "343515223843"
      + source_arn          = (sensitive value)
      + statement_id        = "AllowExecutionFromS3Bucket"
      + statement_id_prefix = (known after apply)
    }

  # aws_lambda_permission.log_alerts_pipeline_error_lambda_allow_cloudwatch will be created
  + resource "aws_lambda_permission" "log_alerts_pipeline_error_lambda_allow_cloudwatch" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "dev-log-alerts-pipeline-error-lambda"
      + id                  = (known after apply)
      + principal           = "logs.eu-west-2.amazonaws.com"
      + region              = "eu-west-2"
      + source_arn          = (sensitive value)
      + statement_id        = "log-alerts-pipeline-error-lambda-allow-cloudwatch"
      + statement_id_prefix = (known after apply)
    }

  # aws_lambda_permission.log_alerts_technical_failures_above_threshold_lambda_allow_cloudwatch will be created
  + resource "aws_lambda_permission" "log_alerts_technical_failures_above_threshold_lambda_allow_cloudwatch" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "dev-log-alerts-technical-failures-above-threshold-lambda"
      + id                  = (known after apply)
      + principal           = "logs.eu-west-2.amazonaws.com"
      + region              = "eu-west-2"
      + source_arn          = (sensitive value)
      + statement_id        = "log-alerts-technical-failures-above-threshold-lambda-allow-cloudwatch"
      + statement_id_prefix = (known after apply)
    }

  # aws_lambda_permission.store_asid_lookup_ses_trigger will be created
  + resource "aws_lambda_permission" "store_asid_lookup_ses_trigger" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "dev_store_asid_lookup_lambda"
      + id                  = (known after apply)
      + principal           = "ses.amazonaws.com"
      + region              = "eu-west-2"
      + source_arn          = (known after apply)
      + statement_id        = "AllowExecutionFromSES"
      + statement_id_prefix = (known after apply)
    }

  # aws_route53_record.gp2gp_inbox_dkim_records[0] will be created
  + resource "aws_route53_record" "gp2gp_inbox_dkim_records" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 1800
      + type            = "CNAME"
      + zone_id         = "Z0811924E54GS533TZXR"
    }

  # aws_route53_record.gp2gp_inbox_dkim_records[1] will be created
  + resource "aws_route53_record" "gp2gp_inbox_dkim_records" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 1800
      + type            = "CNAME"
      + zone_id         = "Z0811924E54GS533TZXR"
    }

  # aws_route53_record.gp2gp_inbox_dkim_records[2] will be created
  + resource "aws_route53_record" "gp2gp_inbox_dkim_records" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 1800
      + type            = "CNAME"
      + zone_id         = "Z0811924E54GS533TZXR"
    }

  # aws_route53_record.gp2gp_inbox_dmarc will be created
  + resource "aws_route53_record" "gp2gp_inbox_dmarc" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_dmarc.mail.dev.gp-registrations-data.nhs.uk"
      + records         = [
          + "v=DMARC1; p=none;",
        ]
      + ttl             = 300
      + type            = "TXT"
      + zone_id         = "Z0811924E54GS533TZXR"
    }

  # aws_s3_bucket.gp2gp_inbox_storage will be created
  + resource "aws_s3_bucket" "gp2gp_inbox_storage" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "prm-gp2gp-inbox-storage-dev"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_region               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = "eu-west-2"
      + request_payer               = (known after apply)
      + tags                        = {
          + "ApplicationRole"     = "AwsS3Bucket"
          + "BackupLocal"         = "False"
          + "BackupRemote"        = "False"
          + "CostCentre"          = "P0688/04"
          + "CreatedBy"           = "gp2gp-reporting-infrastructure"
          + "Customer"            = "NHS D"
          + "DataType"            = "None"
          + "Environment"         = "dev"
          + "Name"                = "prm-gp2gp-inbox-storage-dev"
          + "OnOffPattern"        = "AlwaysOn"
          + "Owner"               = "Candice Moore"
          + "Programme"           = "GP IT Futures"
          + "Project"             = "Patient Record Migration"
          + "ProjectType"         = "Public beta"
          + "PublicFacing"        = "N"
          + "ServiceCategory"     = "Bronze"
          + "TagVersion"          = "1"
          + "Team"                = "Registrations"
          + "data_classification" = "1"
          + "envtype"             = "dev"
        }
      + tags_all                    = {
          + "ApplicationRole"     = "AwsS3Bucket"
          + "BackupLocal"         = "False"
          + "BackupRemote"        = "False"
          + "CostCentre"          = "P0688/04"
          + "CreatedBy"           = "gp2gp-reporting-infrastructure"
          + "Customer"            = "NHS D"
          + "DataType"            = "None"
          + "Environment"         = "dev"
          + "Name"                = "prm-gp2gp-inbox-storage-dev"
          + "OnOffPattern"        = "AlwaysOn"
          + "Owner"               = "Candice Moore"
          + "Programme"           = "GP IT Futures"
          + "Project"             = "Patient Record Migration"
          + "ProjectType"         = "Public beta"
          + "PublicFacing"        = "N"
          + "ServiceCategory"     = "Bronze"
          + "TagVersion"          = "1"
          + "Team"                = "Registrations"
          + "data_classification" = "1"
          + "envtype"             = "dev"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # aws_s3_bucket_acl.gp2gp_inbox_storage will be created
  + resource "aws_s3_bucket_acl" "gp2gp_inbox_storage" {
      + acl    = "private"
      + bucket = (known after apply)
      + id     = (known after apply)
      + region = "eu-west-2"

      + access_control_policy (known after apply)
    }

  # aws_s3_bucket_ownership_controls.email_and_alerting will be created
  + resource "aws_s3_bucket_ownership_controls" "email_and_alerting" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + region = "eu-west-2"

      + rule {
          + object_ownership = "ObjectWriter"
        }
    }

  # aws_s3_bucket_policy.gp2gp_inbox_storage will be created
  + resource "aws_s3_bucket_policy" "gp2gp_inbox_storage" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
      + region = "eu-west-2"
    }

  # aws_s3_bucket_public_access_block.gp2gp_inbox_storage will be created
  + resource "aws_s3_bucket_public_access_block" "gp2gp_inbox_storage" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + region                  = "eu-west-2"
      + restrict_public_buckets = true
    }

  # aws_s3_bucket_versioning.gp2gp_inbox_storage will be created
  + resource "aws_s3_bucket_versioning" "gp2gp_inbox_storage" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + region = "eu-west-2"

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # aws_ses_active_receipt_rule_set.active_rule_set will be created
  + resource "aws_ses_active_receipt_rule_set" "active_rule_set" {
      + arn           = (known after apply)
      + id            = (known after apply)
      + region        = "eu-west-2"
      + rule_set_name = "gp2gp-inbox-rules-dev"
    }

  # aws_ses_domain_dkim.gp2gp_inbox_domain_identification will be created
  + resource "aws_ses_domain_dkim" "gp2gp_inbox_domain_identification" {
      + dkim_tokens = (known after apply)
      + domain      = "mail.dev.gp-registrations-data.nhs.uk"
      + id          = (known after apply)
      + region      = "eu-west-2"
    }

  # aws_ses_domain_identity.gp2gp_inbox will be created
  + resource "aws_ses_domain_identity" "gp2gp_inbox" {
      + arn                = (known after apply)
      + domain             = "mail.dev.gp-registrations-data.nhs.uk"
      + id                 = (known after apply)
      + region             = "eu-west-2"
      + verification_token = (known after apply)
    }

  # aws_ses_email_identity.gp2gp_inbox_sender_address will be created
  + resource "aws_ses_email_identity" "gp2gp_inbox_sender_address" {
      + arn    = (known after apply)
      + email  = (sensitive value)
      + id     = (known after apply)
      + region = "eu-west-2"
    }

  # aws_ses_receipt_rule.asid_lookup will be created
  + resource "aws_ses_receipt_rule" "asid_lookup" {
      + arn           = (known after apply)
      + enabled       = true
      + id            = (known after apply)
      + name          = "store-asid-lookup-in-s3-dev"
      + recipients    = (sensitive value)
      + region        = "eu-west-2"
      + rule_set_name = "gp2gp-inbox-rules-dev"
      + scan_enabled  = true
      + tls_policy    = (known after apply)

      + lambda_action {
          + function_arn    = (known after apply)
          + invocation_type = "Event"
          + position        = 2
            # (1 unchanged attribute hidden)
        }

      + s3_action {
          + bucket_name       = (known after apply)
          + object_key_prefix = "asid_lookup/"
          + position          = 1
            # (3 unchanged attributes hidden)
        }
    }

  # aws_ses_receipt_rule_set.gp2gp_inbox will be created
  + resource "aws_ses_receipt_rule_set" "gp2gp_inbox" {
      + arn           = (known after apply)
      + id            = (known after apply)
      + region        = "eu-west-2"
      + rule_set_name = "gp2gp-inbox-rules-dev"
    }

  # aws_ssm_parameter.gp2gp_dashboard_alert_lambda_arn will be created
  + resource "aws_ssm_parameter" "gp2gp_dashboard_alert_lambda_arn" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/registrations/dev/data-pipeline/email-and-alerting/gp2gp-dashboard-alert-lambda-arn"
      + region         = "eu-west-2"
      + tags           = {
          + "ApplicationRole"     = "AwsSsmParameter"
          + "BackupLocal"         = "False"
          + "BackupRemote"        = "False"
          + "CostCentre"          = "P0688/04"
          + "CreatedBy"           = "gp2gp-reporting-infrastructure"
          + "Customer"            = "NHS D"
          + "DataType"            = "None"
          + "Environment"         = "dev"
          + "Name"                = "dev-gp2gp-dashboard-alert-lambda-arn"
          + "OnOffPattern"        = "AlwaysOn"
          + "Owner"               = "Candice Moore"
          + "Programme"           = "GP IT Futures"
          + "Project"             = "Patient Record Migration"
          + "ProjectType"         = "Public beta"
          + "PublicFacing"        = "N"
          + "ServiceCategory"     = "Bronze"
          + "TagVersion"          = "1"
          + "Team"                = "Registrations"
          + "data_classification" = "1"
          + "envtype"             = "dev"
        }
      + tags_all       = {
          + "ApplicationRole"     = "AwsSsmParameter"
          + "BackupLocal"         = "False"
          + "BackupRemote"        = "False"
          + "CostCentre"          = "P0688/04"
          + "CreatedBy"           = "gp2gp-reporting-infrastructure"
          + "Customer"            = "NHS D"
          + "DataType"            = "None"
          + "Environment"         = "dev"
          + "Name"                = "dev-gp2gp-dashboard-alert-lambda-arn"
          + "OnOffPattern"        = "AlwaysOn"
          + "Owner"               = "Candice Moore"
          + "Programme"           = "GP IT Futures"
          + "Project"             = "Patient Record Migration"
          + "ProjectType"         = "Public beta"
          + "PublicFacing"        = "N"
          + "ServiceCategory"     = "Bronze"
          + "TagVersion"          = "1"
          + "Team"                = "Registrations"
          + "data_classification" = "1"
          + "envtype"             = "dev"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + value_wo       = (write-only attribute)
      + version        = (known after apply)
    }

Plan: 48 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + gp2gp_inbox_storage_bucket_arn = (known after apply)

```

</details>